*** access time records
size = 12800
|   id |      remote |      local |
|    1 |  6190994967 | 5525219763 |
|    2 |  4853278945 | 4454001759 |
|    3 |  5865416519 | 4404425967 |
|    4 |  6259437334 | 5740065838 |
|    5 |  5452799794 | 5076688723 |
| mean | 5724385500. | 5040080410 |
|------+-------------+------------|
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)

It is clear to see the effect of remote access is slower.
  
**** Allocate mx with 12800 * 12800, WITHOUT NUMA awareness
|   id |     access | multiplication | total execution time of program(s) |
|    1 |  430604149 |      935806714 |                            1.30271 |
|    2 |  428375815 |      937043212 |                            1.30204 |
|    3 |  429507786 |      936916666 |                            1.69266 |
|    4 |  428615820 |      937980358 |                            1.30382 |
|    5 |  428463239 |      937544182 |                            1.30078 |
| mean | 429113360. |     937058230. |                           1.380402 |
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)

**** Allocate mx with 8 * 20480000, WITHOUT NUMA awareness
|   id |     access | multiplication | total execution time of program(s) |
|    1 |  680044058 |     6681668916 |                            4.02796 |
|    2 |  682953049 |     6676504701 |                            4.02523 |
|    3 |  687956195 |     6677806353 |                            4.02215 |
|    4 |  685070622 |     6677521668 |                            4.01936 |
|    5 |  684318610 |     6677222508 |                            4.02701 |
| mean | 684068510. |    6678144800. |                           4.024342 |
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)

**** Allocate mx with 8 * 20480000, WITH NUMA awareness
|   id |   access | multiplication | total execution time of program(s) |
|    1 | 56052365 |      803617342 |                            1.19494 |
|    2 | 55887468 |      804099605 |                            1.20406 |
|    3 | 55422889 |      804668921 |                            1.19966 |
|    4 | 55422889 |      804668921 |                            1.19966 |
|    5 | 55915354 |      803988492 |                            1.19751 |
| mean | 55740193 |     804208660. |                           1.199166 |
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)

**** Allocate mx with 12800 * 12800, WITH NUMA awareness
|   id |     access | multiplication | total execution time of program |
|    1 |  162304794 |      153310561 |                         1.01839 |
|    2 |  162328640 |      148230344 |                         1.01127 |
|    3 |  162403576 |      153474228 |                         1.01854 |
|    4 |  161863161 |      154374771 |                         1.01873 |
|    5 |  161203875 |      153011596 |                         1.01798 |
| mean | 162020810. |      152480300 |                        1.016982 |
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)
** problem of using openmp
- To use OpenMP to allocate and access matrix element locally, I need to ensure the openmp execute each thread consistedly during allocation and accessing. But it does not do so. If I use ordered clause to make it so, it becomes serial execution which is no point to use OpenMP
- execution result
  #+BEGIN_SRC sh
    wzhao@r815:~/numa-knn$ ./bin/openmp_matrix_multiplication 64 64
    fix main_thread: 140012401936320 on cpu0
    previous record: thread_53 <=> node_0
    previous record: thread_22 <=> node_0
    previous record: thread_40 <=> node_0
    previous record: thread_15 <=> node_0
    previous record: thread_23 <=> node_0
    previous record: thread_13 <=> node_0
    previous record: thread_59 <=> node_0
    previous record: thread_24 <=> node_0
    current record: thread_24 <=> node_3
    previous record: thread_43 <=> node_0
    current record: thread_43 <=> node_5
    previous record: thread_10 <=> node_0
    current record: thread_10 <=> node_1
    previous record: thread_33 <=> node_0
    current record: thread_33 <=> node_4
    previous record: thread_29 <=> node_0
    current record: thread_29 <=> node_3
    previous record: thread_48 <=> node_0
    current record: thread_48 <=> node_6
    previous record: thread_28 <=> node_0
    current record: thread_28 <=> node_3
    previous record: thread_47 <=> node_0
    current record: thread_47 <=> node_5
    previous record: thread_16 <=> node_0
    current record: thread_16 <=> node_2
    previous record: thread_11 <=> node_0
    current record: thread_11 <=> node_1
    previous record: thread_31 <=> node_0
    previous record: thread_34 <=> node_0
    current record: thread_34 <=> node_4
    previous record: thread_55 <=> node_0
    current record: thread_55 <=> node_6
    previous record: thread_41 <=> node_0
    current record: thread_41 <=> node_5
    previous record: thread_20 <=> node_0
    current record: thread_20 <=> node_2
    previous record: thread_51 <=> node_0
    current record: thread_51 <=> node_6
    previous record: thread_18 <=> node_0
    current record: thread_18 <=> node_2
    previous record: thread_17 <=> node_0
    current record: thread_17 <=> node_2
    previous record: thread_32 <=> node_0
    current record: thread_32 <=> node_4
    previous record: thread_44 <=> node_0
    current record: thread_44 <=> node_5
    previous record: thread_56 <=> node_0
    current record: thread_56 <=> node_7
    previous record: thread_49 <=> node_0
    current record: thread_49 <=> node_6
    previous record: thread_63 <=> node_0
    current record: thread_63 <=> node_7
    previous record: thread_54 <=> node_0
    current record: thread_54 <=> node_6
    previous record: thread_61 <=> node_0
    current record: thread_61 <=> node_7
    previous record: thread_26 <=> node_0
    current record: thread_26 <=> node_3
    previous record: thread_42 <=> node_0
    current record: thread_42 <=> node_5
    current record: thread_53 <=> node_6
    previous record: thread_57 <=> node_0
    current record: thread_57 <=> node_7
    previous record: thread_9 <=> node_0
    current record: thread_9 <=> node_1
    previous record: thread_52 <=> node_0
    current record: thread_52 <=> node_6
    previous record: thread_50 <=> node_0
    current record: thread_50 <=> node_6
    previous record: thread_46 <=> node_0
    current record: thread_46 <=> node_5
    current record: thread_22 <=> node_2
    previous record: thread_35 <=> node_0
    current record: thread_35 <=> node_4
    previous record: thread_36 <=> node_0
    current record: thread_36 <=> node_4
    previous record: thread_25 <=> node_0
    current record: thread_25 <=> node_3
    previous record: thread_38 <=> node_0
    current record: thread_38 <=> node_4
    previous record: thread_37 <=> node_0
    current record: thread_37 <=> node_4
    current record: thread_40 <=> node_5
    previous record: thread_58 <=> node_0
    current record: thread_58 <=> node_7
    previous record: thread_62 <=> node_0
    current record: thread_62 <=> node_7
    current record: thread_15 <=> node_1
    previous record: thread_12 <=> node_0
    current record: thread_12 <=> node_1
    current record: thread_23 <=> node_2
    previous record: thread_45 <=> node_0
    current record: thread_45 <=> node_5
    current record: thread_13 <=> node_1
    current record: thread_59 <=> node_7
    previous record: thread_19 <=> node_0
    current record: thread_19 <=> node_2
    previous record: thread_30 <=> node_0
    current record: thread_30 <=> node_3
    previous record: thread_27 <=> node_0
    current record: thread_27 <=> node_3
    previous record: thread_21 <=> node_0
    current record: thread_21 <=> node_2
    current record: thread_31 <=> node_3
    previous record: thread_60 <=> node_0
    current record: thread_60 <=> node_7
    previous record: thread_39 <=> node_0
    current record: thread_39 <=> node_4
    previous record: thread_14 <=> node_0
    current record: thread_14 <=> node_1
    parallel access use: 107051367
    parallel matrix multiplication use: 17470602
  #+END_SRC
- Time record
  |        id |    access | multiplication | without_access | without_multiplication |
  |         1 | 333679058 |       86703288 |      307299765 |               98623590 |
  |         2 | 322496449 |       81689395 |      299924519 |               85783732 |
  |         3 | 346066176 |       81845200 |      319220052 |              100671163 |
  |         4 | 350297098 |       79371861 |      303946232 |               85174860 |
  |      mean | 338134700 |       82402436 |      307597642 |               92563336 |
  |-----------+-----------+----------------+----------------+------------------------|
  | pthread_1 | 270228380 |      532114935 |                |                        |
  | pthread_2 | 321331300 |     3474300200 |                |                        |
#+TBLFM: @6$2=vmean(@2..@5)::@6$3=vmean(@2..@5)::@6$4=vmean(@2..@5)::@6$5=vmean(@2..@5)

***** ===Allocate mx with 8 * 20480000, WITH NUMA awareness
|   id |   access | multiplication |
|    1 | 62395687 |      732743679 |
|    2 | 62029517 |      730706185 |
|    3 | 56135640 |      728912121 |
|    4 | 55443448 |      728838934 |
| mean | 59001073 |      730300230 |
#+TBLFM: @6$2=vmean(@2..@5)::@6$3=vmean(@2..@5)

***** ===Allocate mx with 12800 * 12800, WITH NUMA awareness:
|   id |    access | multiplication |           |           |
|    1 | 157397744 |      145636085 | 157066664 | 153113354 |
|    2 | 154774561 |      152104165 | 158771222 | 152392162 |
|    3 | 157017712 |      148060454 | 155616274 | 151821547 |
|    4 | 160361269 |      147043263 |           | 151334586 |
| mean | 157387820 |      148210990 |           |           |
#+TBLFM: @6$2=vmean(@2..@5)::@6$3=vmean(@2..@5)

***** OpenMP WITHOUT NUMA
|   id |     access | multiplication | total execution time of program(s) |
|    1 |  320158095 |       59331935 |                            3.48299 |
|    2 |  284337430 |       40079501 |                            3.70962 |
|    3 |  289169162 |       37238352 |                            3.76046 |
|    4 |  289169162 |       37238352 |                            3.76046 |
|    5 |  279510204 |       26479233 |                            4.05004 |
| mean | 292468810. |      40073475. |                           3.752714 |
|------+------------+----------------+------------------------------------|
#+TBLFM: @6$2=vmean(@2..@5)::@6$3=vmean(@2..@5)::@6$4=vmean(@2..@5)::@7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)

***** OpenMP WITH NUMA
|   id |     access | multiplication | total execution time of program(s) |
|    1 |  310407371 |       26091806 |                            4.70972 |
|    2 |  339623837 |       31384191 |                            5.03681 |
|    3 |  331996566 |       26439365 |                            4.61384 |
|    4 |  309772190 |       27053034 |                            4.94841 |
|    5 |  323199487 |       29638938 |                            4.27998 |
| MEAN | 322999890. |      28121467. |                           4.717752 |
|------+------------+----------------+------------------------------------|
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)::@13$2=vmean(@2..@12)::@13$3=vmean(@2..@12)::@13$4=vmean(@2..@12)

**** time mesurement 
#+BEGIN_SRC sh
  cat numa_openmp.sh
  export OMP_PLACES="{0, 4, 8, 12, 16, 20, 24, 28}, {32, 36, 40, 44, 48, 52, 56, 60}, {2, 6, 10, 14, 18, 22, 26, 30}, {34, 38, 42, 46, 50, 54, 58, 62}, {3, 7, 11, 15, 19, 23, 27, 31}, {35, 39, 43, 47, 51, 55, 59, 63}, {1, 5, 9, 13, 17, 21, 25, 29}, {33, 37, 41, 45, 49, 53, 57, 61}"
  ./bin/numa_openmp 16000 16000 8
  ./bin/anti_numa_openmp 16000 16000 8
  ./bin/openmp_without_numa 16000 16000 8
#+END_SRC
|   id | use libnuma(ms) | not use libnuma(ms) | use libnuma on remote node |
|    1 |            3880 |                 420 |                       3934 |
|    2 |            4034 |                 416 |                       3973 |
|    3 |            4020 |                 418 |                       3960 |
|    4 |            3975 |                 419 |                       3951 |
|    5 |            4033 |                 413 |                       3908 |
| mean |          3988.4 |               417.2 |                     3945.2 |
#+TBLFM: @7$2=vmean(@2..@6)::@7$3=vmean(@2..@6)::@7$4=vmean(@2..@6)
- It seems this approach make the libnuma case becomes worse.
- The execution time of using libnuma and the execution time of using libnuma but allocated memory deliberately on remote node is also similar. This indicate I have lot of remote memory access cases.
- This whole program is wrong because each row of the matrix need to multiple very element of vector, there is no point of allocation vector across multiple nodes.

